from aiogram.enums import ParseMode
from aiogram.client.default import DefaultBotProperties

import os
from dotenv import load_dotenv

load_dotenv()

BOT_TOKEN = os.environ.get("BOT_TOKEN")

DEFAULT_BOT_PROPERTIES = {"parse_mode": ParseMode.HTML}

DEFAULT_BOT_PROPERTIES = DefaultBotProperties(parse_mode=ParseMode.MARKDOWN)

HELP_TEXT = (
    "CarForSaleBot — це ваш особистий інструмент для швидкої та зручної купівлі та продажу автомобілів у Telegram.\n\n"
    "**Що ви можете робити з CarForSaleBot:**\n\n"
    "/sell - Легко продати своє авто: Розмістіть оголошення за кілька хвилин, додайте фото та детальний опис.\n\n"
    "/buy - Знайти авто мрії: Переглядайте тисячі оголошень, фільтруйте за маркою, моделлю, ціною та іншими параметрами."
)

ABOUT_US_TEXT = """
⭐️ Проєкт: CarForSaleBot (Купівля/Продаж Авто)

🤝 Мета проєкту (Навчальна):
Цей Telegram-бот розроблений командою студентів [ІПЗ-11] в рамках курсового проєкту з дисципліни "[Основи програмної інженарії]".

Основна мета розробки - демонстрація практичних навичок у сфері:
- Розробки чат-ботів (Python, Telegram API).
- Реалізації багатоетапного збору даних.

💻 Технічна реалізація
- Платформа: Telegram
- Мова програмування: Python
- Бібліотека: aiogram (Асинхронна)

👥 Команда розробників:
- Головний розробник: [Ремез Михайло]
- Backend-розробник: [Кадик Владислав]

💡 Функціонал бота
CarForSaleBot призначений для автоматизації процесу розміщення оголошень про продаж авто (/sell) та пошуку автомобілів (/buy). Це прототип функціональної торгової платформи.

---
Дякуємо, що тестуєте наш проєкт! Ваш відгук важливий для успішного захисту.
"""
