import telebot
from keyboard import get_main_keyboard

bot = telebot.TeleBot("8117385329:AAFwTXqVa8Y6VTfoZs64wgwxIiG6xhowfF8")


@bot.message_handler(commands=["start"])
def main(message):
    bot.send_message(
        message.chat.id,
        f"Привіт,{message.from_user.first_name}",
    )


help_text = (
    "CarForSaleBot — це ваш особистий інструмент для швидкої та зручної купівлі та продажу автомобілів у Telegram.\n\n"
    "**Що ви можете робити з CarForSaleBot:**\n\n"
    "/sale - Легко продати своє авто: Розмістіть оголошення за кілька хвилин, додайте фото та детальний опис.\n\n"
    "/buy - Знайти авто мрії: Переглядайте тисячі оголошень, фільтруйте за маркою, моделлю, ціною та іншими параметрами."
)


@bot.message_handler(commands=["help"])
def main(message):
    bot.send_message(message.chat.id, text=help_text, parse_mode="Markdown")


about_us_text = """
⭐️ Проєкт: CarForSaleBot (Купівля/Продаж Авто)

🤝 Мета проєкту (Навчальна):
Цей Telegram-бот розроблений командою студентів [ІПЗ-11] в рамках курсового проєкту з дисципліни "[Основи програмної інженарії]".

Основна мета розробки - демонстрація практичних навичок у сфері:
- Розробки чат-ботів (Python, Telegram API).
- Реалізації багатоетапного збору даних.

💻 Технічна реалізація
- Платформа: Telegram
- Мова програмування: Python
- Бібліотека: pyTelegramBotAPI

👥 Команда розробників:
- Головний розробник: [Ремез Михайло]
- Backend-розробник: [Кадик Владислав]

💡 Функціонал бота
CarForSaleBot призначений для автоматизації процесу розміщення оголошень про продаж авто (/sale) та пошуку автомобілів (/buy). Це прототип функціональної торгової платформи.

---
Дякуємо, що тестуєте наш проєкт! Ваш відгук важливий для успішного захисту.
"""


@bot.message_handler(commands=["aboutus"])
def handle_aboutus_command(message):
    bot.send_message(message.chat.id, text=about_us_text)


@bot.message_handler(func=lambda message: message.text.startswith("/"))
def handle_unknown_commands(message):
    error_message = "❌ **Невірна команда.** Будь ласка, використайте команду: /help."

    bot.send_message(chat_id=message.chat.id, text=error_message, parse_mode="Markdown")


bot.infinity_polling()
